app/controllers/ratings_controller.rb

  def create
    @subject = Subject.find(params[:subject_id])
    @rating = @subject.ratings.create(rating_params)
	@rating.user_id=current_user.id if current_user
	@rating.save
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "ratings" ("body", "subject_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "test23"], ["subject_id", 2], ["user_id", 1], ["created_at", 2017-02-14 18:07:16 UTC], ["updated_at", 2017-02-14 18:07:16 UTC]]
UPDATE "ratings" SET "user_id" = ?, "updated_at" = ? WHERE "ratings"."id" = ?  [["user_id", 2], ["updated_at", 2017-03-08 16:34:10 UTC], ["id", 8]]

  def destroy
    @subject = Subject.find(params[:subject_id])
    @rating = @subject.ratings.find(params[:id])
    @rating.destroy
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."subject_id" = ? AND "ratings"."id" = ? LIMIT ?  [["subject_id", 1], ["id", 3], ["LIMIT", 1]]
DELETE FROM "ratings" WHERE "ratings"."id" = ?  [["id", 3]]