app/controllers/subjects_controller.rb

	def index
		@subjects = Subject.all
---
SELECT "subjects".* FROM "subjects"

	def show
		@subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def edit
		@subject = Subject.find(params[:id])
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@subject = Subject.new(subject_params)

		if @subject.save
---
INSERT INTO "subjects" ("subjectName", "site", "category", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["subjectName", "test"], ["site", "test"], ["category", "test"], ["created_at", 2017-02-01 18:01:35 UTC], ["updated_at", 2017-02-01 18:01:35 UTC]]

	def destroy
	  @subject = Subject.find(params[:id])
	  @subject.destroy
---
SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 4]]